Revit 2027 API
ParameterUtils.DownloadParameterOptions(ForgeTypeId) Method
Note: This API is now obsolete.
 Retrieves settings associated with the given parameter from the Parameters Service.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[ObsoleteAttribute("This method is deprecated in Revit 2027 and may be removed in a later version of Revit. We suggest you use the overload which accepts a region input instead.")]
public static ParameterDownloadOptions DownloadParameterOptions(
	ForgeTypeId parameterTypeId
)
<ObsoleteAttribute("This method is deprecated in Revit 2027 and may be removed in a later version of Revit. We suggest you use the overload which accepts a region input instead.")>
Public Shared Function DownloadParameterOptions (
	parameterTypeId As ForgeTypeId
) As ParameterDownloadOptions
public:
[ObsoleteAttribute(L"This method is deprecated in Revit 2027 and may be removed in a later version of Revit. We suggest you use the overload which accepts a region input instead.")]
static ParameterDownloadOptions^ DownloadParameterOptions(
	ForgeTypeId^ parameterTypeId
)
[<ObsoleteAttribute("This method is deprecated in Revit 2027 and may be removed in a later version of Revit. We suggest you use the overload which accepts a region input instead.")>]
static member DownloadParameterOptions :
        parameterTypeId : ForgeTypeId -> ParameterDownloadOptions
Parameters
parameterTypeId ForgeTypeId
 Parameter identifier.
Return Value
ParameterDownloadOptions
 Settings associated with a parameter.
Exceptions
Exception | Condition
AccessDeniedException |  Thrown when the user is not authorized to access the requested information.
ArgumentException |  Thrown when the given parameter identifier is empty.
ArgumentNullException |  A non-optional argument was null
[!:Autodesk::Revit::Exceptions::NetworkCommunicationError] |  Thrown when communication with the Parameters Service is unsuccessful.
ResourceNotFoundException |  Thrown when the requested parameter is not found.
ServerInternalException |  Thrown when the Parameters Service reports an internal error.
UnauthenticatedException |  Thrown when the user is not signed in.
Remarks
The settings associated with a parameter definition are accessible only to an authorized user. To retrieve them, the user must be signed in.
This method only supports parameter definitions on Parameters Service accounts in the US.
See Also
Reference
ParameterUtils Class
DownloadParameterOptions Overload
Autodesk.Revit.DB Namespace